In [ ]:
import numpy as np
import pandas as pd

In [ ]:
my_list = [1,2,3]

In [ ]:
pd.Series(my_list)

In [ ]:
labels = ['a','b','c']
pd.Series(my_list, index = labels)

In [ ]:
df = pd.DataFrame(data = np.random.randn(4,4),  index = 'A B C D'.split(), columns = 'W X Y Z'.split())
df

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df.describe().T #  (.T ->  transpose)

In [ ]:
df.describe().transpose()

In [19]:
df['W'] # this returns an array

A    0.474302
B   -0.406510
C   -0.955512
D    0.194670
Name: W, dtype: float64

In [29]:
b = df[['W']] # this returns a dataframe
b

          W
A  0.474302
B -0.406510
C -0.955512
D  0.194670

In [39]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.474302 -0.397667  1.533065 -1.193484  2.007367
B -0.406510 -1.877628 -0.270582 -0.461460 -0.677093
C -0.955512 -0.267775  0.502403  1.337423 -0.453109
D  0.194670 -1.075903  0.439536 -1.524457  0.634207

In [40]:
'to drop a row'
'axis = 0, -> row, axis = 1 -> column'
df.drop('A', axis = 0)

          W         X         Y         Z       new
B -0.406510 -1.877628 -0.270582 -0.461460 -0.677093
C -0.955512 -0.267775  0.502403  1.337423 -0.453109
D  0.194670 -1.075903  0.439536 -1.524457  0.634207

In [33]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  0.474302 -0.397667  1.533065 -1.193484
B -0.406510 -1.877628 -0.270582 -0.461460
C -0.955512 -0.267775  0.502403  1.337423
D  0.194670 -1.075903  0.439536 -1.524457

In [41]:
df

          W         X         Y         Z       new
A  0.474302 -0.397667  1.533065 -1.193484  2.007367
B -0.406510 -1.877628 -0.270582 -0.461460 -0.677093
C -0.955512 -0.267775  0.502403  1.337423 -0.453109
D  0.194670 -1.075903  0.439536 -1.524457  0.634207

In [42]:
# inplace is used to make permanent changes to dataframe
df.drop('new', axis = 1, inplace = True)

In [43]:
df

          W         X         Y         Z
A  0.474302 -0.397667  1.533065 -1.193484
B -0.406510 -1.877628 -0.270582 -0.461460
C -0.955512 -0.267775  0.502403  1.337423
D  0.194670 -1.075903  0.439536 -1.524457

In [44]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B': [2,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [46]:
df.dropna()

     A    B  C
0  1.0  2.0  1

In [48]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [49]:
df

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [50]:
df.fillna('any_value')

           A          B  C
0        1.0        2.0  1
1        2.0  any_value  2
2  any_value  any_value  3

In [52]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [90]:
df = pd.DataFrame({'names':'PJ PJ T3 M3'.split(),
                  'GPA':[4,4,3.8,3.5]},
                  index = 'A B C D'.split())
df

  names  GPA
A    PJ  4.0
B    PJ  4.0
C    T3  3.8
D    M3  3.5

In [58]:
df['names'].unique()

array(['PJ', 'T3', 'M3'], dtype=object)

In [59]:
df['names'].nunique()

3

In [61]:
df['names'].value_counts()

PJ    2
T3    1
M3    1
Name: names, dtype: int64

In [72]:
df['GPA'].value_counts()

4.0    2
3.8    1
3.5    1
Name: GPA, dtype: int64

In [85]:
df

  names  GPA
A    PJ  4.0
B    PJ  4.0
C    T3  3.8
D    M3  3.5

In [92]:
df.reset_index(inplace = True)

In [93]:
df

  index names  GPA
0     A    PJ  4.0
1     B    PJ  4.0
2     C    T3  3.8
3     D    M3  3.5

In [94]:
df.set_index('index')

      names  GPA
index
A        PJ  4.0
B        PJ  4.0
C        T3  3.8
D        M3  3.5

In [95]:
df['GPA'] > 3.6

0     True
1     True
2     True
3    False
Name: GPA, dtype: bool

In [101]:
temp = []
for x in df['GPA']:
    if x>3.6:
        temp.append('pass')
    else:
        temp.append('fail')
        
df['is_pass'] = temp
df

  index names  GPA is_pass
0     A    PJ  4.0    pass
1     B    PJ  4.0    pass
2     C    T3  3.8    pass
3     D    M3  3.5    fail

In [ ]:
df['is_pass2'] = ['pass' if x > 3.6 else 'fail' for x in df['GPA']]
df

  index names  GPA is_pass is_pass2
0     A    PJ  4.0    pass     pass
1     B    PJ  4.0    pass     pass
2     C    T3  3.8    pass     pass
3     D    M3  3.5    fail     fail

In [104]:

df.loc[df['GPA']> 3.6, 'is_pass3'] = 'pass'
'for the rows of GPA-columns whose values are greater than 3.6, create another column for them with their values = pass'
df.loc[df['GPA'] <3.6, 'is_pass3'] = 'fail'
df

  index names  GPA is_pass is_pass2 is_pass3
0     A    PJ  4.0    pass     pass     pass
1     B    PJ  4.0    pass     pass     pass
2     C    T3  3.8    pass     pass     pass
3     D    M3  3.5    fail     fail     fail